In [3]:
#CPI All Urban Consumers 1976-1985
import requests
import json
import pandas as pd
headers = {'Content-type': 'application/json'}
data = json.dumps({"seriesid": ['CUUR0000SA0L1E'],"startyear":"1976", "endyear":"2018"})
p = requests.post('https://api.bls.gov/publicAPI/v2/timeseries/data/', data=data, headers=headers)
json_data = json.loads(p.text)

In [4]:
data = []
month = []
year = []


for results in json_data['Results']['series'][0]['data']:
    data.append(results["value"])
    month.append(results["periodName"])
    year.append(results["year"])

new_dict = {"year": year, "month": month, "data": data}
cpi = pd.DataFrame(new_dict)
cpi

     year      month   data
0    1985   December  111.3
1    1985   November  111.2
2    1985    October  110.7
3    1985  September  110.0
4    1985     August  109.4
..    ...        ...    ...
115  1976        May   57.0
116  1976      April   56.7
117  1976      March   56.4
118  1976   February   56.0
119  1976    January   55.7

[120 rows x 3 columns]

In [5]:
#CPI All Urban Consumers 1986-1995
headers = {'Content-type': 'application/json'}
data = json.dumps({"seriesid": ['CUUR0000SA0L1E'],"startyear":"1986", "endyear":"2018"})
p = requests.post('https://api.bls.gov/publicAPI/v2/timeseries/data/', data=data, headers=headers)
json_data_2 = json.loads(p.text)

In [6]:
data_2 = []
month_2 = []
year_2 = []


for results in json_data_2['Results']['series'][0]['data']:
    data_2.append(results["value"])
    month_2.append(results["periodName"])
    year_2.append(results["year"])

new_dict = {"year": year_2, "month": month_2, "data": data_2}
cpi_2 = pd.DataFrame(new_dict)
cpi_2

     year      month   data
0    1995   December  162.7
1    1995   November  163.0
2    1995    October  162.8
3    1995  September  162.1
4    1995     August  161.6
..    ...        ...    ...
115  1986        May  112.9
116  1986      April  112.7
117  1986      March  112.3
118  1986   February  111.9
119  1986    January  111.6

[120 rows x 3 columns]

In [7]:
#CPI All Urban Consumers 1996-2005
headers = {'Content-type': 'application/json'}
data = json.dumps({"seriesid": ['CUUR0000SA0L1E'],"startyear":"1996", "endyear":"2018"})
p = requests.post('https://api.bls.gov/publicAPI/v2/timeseries/data/', data=data, headers=headers)
json_data_3 = json.loads(p.text)

In [8]:
data_3 = []
month_3 = []
year_3 = []


for results in json_data_3['Results']['series'][0]['data']:
    data_3.append(results["value"])
    month_3.append(results["periodName"])
    year_3.append(results["year"])

new_dict = {"year": year_3, "month": month_3, "data": data_3}
cpi_3 = pd.DataFrame(new_dict)
cpi_3

     year      month   data
0    2005   December  202.1
1    2005   November  202.3
2    2005    October  202.3
3    2005  September  201.3
4    2005     August  201.0
..    ...        ...    ...
115  1996        May  165.1
116  1996      April  165.0
117  1996      March  164.9
118  1996   February  164.2
119  1996    January  163.4

[120 rows x 3 columns]

In [9]:
#CPI All Urban Consumers 2006-2015
headers = {'Content-type': 'application/json'}
data = json.dumps({"seriesid": ['CUUR0000SA0L1E'],"startyear":"2006", "endyear":"2018"})
p = requests.post('https://api.bls.gov/publicAPI/v2/timeseries/data/', data=data, headers=headers)
json_data_4 = json.loads(p.text)

In [10]:
json_data_4['Results']['series'][0]['data'][0]

{'year': '2015',
 'period': 'M12',
 'periodName': 'December',
 'value': '243.779',
 'footnotes': [{}]}

In [ ]:
from pandas.io.json import json_normalize

In [11]:
data_4 = []
month_4 = []
year_4_2 = []

for results in json_data_4['Results']['series'][0]['data']:
    data_4.append(results["value"])
    month_4.append(results["periodName"])
    year_4_2.append(results["year"])

In [13]:
new_dict = {"year": year_4_2, "month": month_4, "data": data_4}
cpi_4 = pd.DataFrame(new_dict)
cpi_4

     year      month     data
0    2015   December  243.779
1    2015   November  244.075
2    2015    October  243.985
3    2015  September  243.359
4    2015     August  242.651
..    ...        ...      ...
115  2006        May    205.7
116  2006      April    205.5
117  2006      March    204.9
118  2006   February    203.6
119  2006    January    202.6

[120 rows x 3 columns]

In [14]:
#Period CPI Final
cpi_f = pd.concat([cpi,cpi_2,cpi_3,cpi_4])
cpi_f

     year      month   data
0    1985   December  111.3
1    1985   November  111.2
2    1985    October  110.7
3    1985  September  110.0
4    1985     August  109.4
..    ...        ...    ...
115  2006        May  205.7
116  2006      April  205.5
117  2006      March  204.9
118  2006   February  203.6
119  2006    January  202.6

[480 rows x 3 columns]

In [ ]:
##############################################################

In [28]:
headers = {'Content-type': 'application/json'}
data = json.dumps({"seriesid": ['EES10140001'],"startyear":"1976", "endyear":"2018"})
p = requests.post('https://api.bls.gov/publicAPI/v2/timeseries/data/', data=data, headers=headers)
json_data = json.loads(p.text)

In [29]:
json_data

{'status': 'REQUEST_SUCCEEDED',
 'responseTime': 174,
 'message': ['Year range has been reduced to the system-allowed limit of 10 years.'],
 'Results': {'series': [{'seriesID': 'EES10140001',
    'data': [{'year': '1985',
      'period': 'M12',
      'periodName': 'December',
      'value': '109',
      'footnotes': [{}]},
     {'year': '1985',
      'period': 'M11',
      'periodName': 'November',
      'value': '110',
      'footnotes': [{}]},
     {'year': '1985',
      'period': 'M10',
      'periodName': 'October',
      'value': '110',
      'footnotes': [{}]},
     {'year': '1985',
      'period': 'M09',
      'periodName': 'September',
      'value': '110',
      'footnotes': [{}]},
     {'year': '1985',
      'period': 'M08',
      'periodName': 'August',
      'value': '110',
      'footnotes': [{}]},
     {'year': '1985',
      'period': 'M07',
      'periodName': 'July',
      'value': '110',
      'footnotes': [{}]},
     {'year': '1985',
      'period': 'M06',
      'periodName': 'June',
      'value': '111',
      'footnotes': [{}]},
     {'year': '1985',
      'period': 'M05',
      'periodName': 'May',
      'value': '111',
      'footnotes': [{}]},
     {'year': '1985',
      'period': 'M04',
      'periodName': 'April',
      'value': '111',
      'footnotes': [{}]},
     {'year': '1985',
      'period': 'M03',
      'periodName': 'March',
      'value': '110',
      'footnotes': [{}]},
     {'year': '1985',
      'period': 'M02',
      'periodName': 'February',
      'value': '109',
      'footnotes': [{}]},
     {'year': '1985',
      'period': 'M01',
      'periodName': 'January',
      'value': '111',
      'footnotes': [{}]},
     {'year': '1984',
      'period': 'M12',
      'periodName': 'December',
      'value': '110',
      'footnotes': [{}]},
     {'year': '1984',
      'period': 'M11',
      'periodName': 'November',
      'value': '109',
      'footnotes': [{}]},
     {'year': '1984',
      'period': 'M10',
      'periodName': 'October',
      'value': '110',
      'footnotes': [{}]},
     {'year': '1984',
      'period': 'M09',
      'periodName': 'September',
      'value': '109',
      'footnotes': [{}]},
     {'year': '1984',
      'period': 'M08',
      'periodName': 'August',
      'value': '109',
      'footnotes': [{}]},
     {'year': '1984',
      'period': 'M07',
      'periodName': 'July',
      'value': '109',
      'footnotes': [{}]},
     {'year': '1984',
      'period': 'M06',
      'periodName': 'June',
      'value': '109',
      'footnotes': [{}]},
     {'year': '1984',
      'period': 'M05',
      'periodName': 'May',
      'value': '108',
      'footnotes': [{}]},
     {'year': '1984',
      'period': 'M04',
      'periodName': 'April',
      'value': '107',
      'footnotes': [{}]},
     {'year': '1984',
      'period': 'M03',
      'periodName': 'March',
      'value': '108',
      'footnotes': [{}]},
     {'year': '1984',
      'period': 'M02',
      'periodName': 'February',
      'value': '107',
      'footnotes': [{}]},
     {'year': '1984',
      'period': 'M01',
      'periodName': 'January',
      'value': '107',
      'footnotes': [{}]},
     {'year': '1983',
      'period': 'M12',
      'periodName': 'December',
      'value': '106',
      'footnotes': [{}]},
     {'year': '1983',
      'period': 'M11',
      'periodName': 'November',
      'value': '106',
      'footnotes': [{}]},
     {'year': '1983',
      'period': 'M10',
      'periodName': 'October',
      'value': '105',
      'footnotes': [{}]},
     {'year': '1983',
      'period': 'M09',
      'periodName': 'September',
      'value': '105',
      'footnotes': [{}]},
     {'year': '1983',
      'period': 'M08',
      'periodName': 'August',
      'value': '104',
      'footnotes': [{}]},
     {'year': '1983',
      'period': 'M07',
      'periodName': 'July',
      'value': '104',
      'footnotes': [{}]},
     {'year': '1983',
      'period': 'M06',
      'periodName': 'June',
      'value': '104',
      'footnotes': [{}]},
     {'year': '1983',
      'period': 'M05',
      'periodName': 'May',
      'value': '104',
      'footnotes': [{}]},
     {'year': '1983',
      'period': 'M04',
      'periodName': 'April',
      'value': '104',
      'footnotes': [{}]},
     {'year': '1983',
      'period': 'M03',
      'periodName': 'March',
      'value': '104',
      'footnotes': [{}]},
     {'year': '1983',
      'period': 'M02',
      'periodName': 'February',
      'value': '102',
      'footnotes': [{}]},
     {'year': '1983',
      'period': 'M01',
      'periodName': 'January',
      'value': '105',
      'footnotes': [{}]},
     {'year': '1982',
      'period': 'M12',
      'periodName': 'December',
      'value': '106',
      'footnotes': [{}]},
     {'year': '1982',
      'period': 'M11',
      'periodName': 'November',
      'value': '107',
      'footnotes': [{}]},
     {'year': '1982',
      'period': 'M10',
      'periodName': 'October',
      'value': '108',
      'footnotes': [{}]},
     {'year': '1982',
      'period': 'M09',
      'periodName': 'September',
      'value': '109',
      'footnotes': [{}]},
     {'year': '1982',
      'period': 'M08',
      'periodName': 'August',
      'value': '109',
      'footnotes': [{}]},
     {'year': '1982',
      'period': 'M07',
      'periodName': 'July',
      'value': '109',
      'footnotes': [{}]},
     {'year': '1982',
      'period': 'M06',
      'periodName': 'June',
      'value': '110',
      'footnotes': [{}]},
     {'year': '1982',
      'period': 'M05',
      'periodName': 'May',
      'value': '110',
      'footnotes': [{}]},
     {'year': '1982',
      'period': 'M04',
      'periodName': 'April',
      'value': '111',
      'footnotes': [{}]},
     {'year': '1982',
      'period': 'M03',
      'periodName': 'March',
      'value': '113',
      'footnotes': [{}]},
     {'year': '1982',
      'period': 'M02',
      'periodName': 'February',
      'value': '113',
      'footnotes': [{}]},
     {'year': '1982',
      'period': 'M01',
      'periodName': 'January',
      'value': '113',
      'footnotes': [{}]},
     {'year': '1981',
      'period': 'M12',
      'periodName': 'December',
      'value': '116',
      'footnotes': [{}]},
     {'year': '1981',
      'period': 'M11',
      'periodName': 'November',
      'value': '115',
      'footnotes': [{}]},
     {'year': '1981',
      'period': 'M10',
      'periodName': 'October',
      'value': '115',
      'footnotes': [{}]},
     {'year': '1981',
      'period': 'M09',
      'periodName': 'September',
      'value': '116',
      'footnotes': [{}]},
     {'year': '1981',
      'period': 'M08',
      'periodName': 'August',
      'value': '117',
      'footnotes': [{}]},
     {'year': '1981',
      'period': 'M07',
      'periodName': 'July',
      'value': '117',
      'footnotes': [{}]},
     {'year': '1981',
      'period': 'M06',
      'periodName': 'June',
      'value': '118',
      'footnotes': [{}]},
     {'year': '1981',
      'period': 'M05',
      'periodName': 'May',
      'value': '120',
      'footnotes': [{}]},
     {'year': '1981',
      'period': 'M04',
      'periodName': 'April',
      'value': '121',
      'footnotes': [{}]},
     {'year': '1981',
      'period': 'M03',
      'periodName': 'March',
      'value': '122',
      'footnotes': [{}]},
     {'year': '1981',
      'period': 'M02',
      'periodName': 'February',
      'value': '123',
      'footnotes': [{}]},
     {'year': '1981',
      'period': 'M01',
      'periodName': 'January',
      'value': '123',
      'footnotes': [{}]},
     {'year': '1980',
      'period': 'M12',
      'periodName': 'December',
      'value': '122',
      'footnotes': [{}]},
     {'year': '1980',
      'period': 'M11',
      'periodName': 'November',
      'value': '120',
      'footnotes': [{}]},
     {'year': '1980',
      'period': 'M10',
      'periodName': 'October',
      'value': '120',
      'footnotes': [{}]},
     {'year': '1980',
      'period': 'M09',
      'periodName': 'September',
      'value': '120',
      'footnotes': [{}]},
     {'year': '1980',
      'period': 'M08',
      'periodName': 'August',
      'value': '120',
      'footnotes': [{}]},
     {'year': '1980',
      'period': 'M07',
      'periodName': 'July',
      'value': '121',
      'footnotes': [{}]},
     {'year': '1980',
      'period': 'M06',
      'periodName': 'June',
      'value': '123',
      'footnotes': [{}]},
     {'year': '1980',
      'period': 'M05',
      'periodName': 'May',
      'value': '124',
      'footnotes': [{}]},
     {'year': '1980',
      'period': 'M04',
      'periodName': 'April',
      'value': '124',
      'footnotes': [{}]},
     {'year': '1980',
      'period': 'M03',
      'periodName': 'March',
      'value': '126',
      'footnotes': [{}]},
     {'year': '1980',
      'period': 'M02',
      'periodName': 'February',
      'value': '127',
      'footnotes': [{}]},
     {'year': '1980',
      'period': 'M01',
      'periodName': 'January',
      'value': '129',
      'footnotes': [{}]},
     {'year': '1979',
      'period': 'M12',
      'periodName': 'December',
      'value': '127',
      'footnotes': [{}]},
     {'year': '1979',
      'period': 'M11',
      'periodName': 'November',
      'value': '125',
      'footnotes': [{}]},
     {'year': '1979',
      'period': 'M10',
      'periodName': 'October',
      'value': '125',
      'footnotes': [{}]},
     {'year': '1979',
      'period': 'M09',
      'periodName': 'September',
      'value': '125',
      'footnotes': [{}]},
     {'year': '1979',
      'period': 'M08',
      'periodName': 'August',
      'value': '125',
      'footnotes': [{}]},
     {'year': '1979',
      'period': 'M07',
      'periodName': 'July',
      'value': '124',
      'footnotes': [{}]},
     {'year': '1979',
      'period': 'M06',
      'periodName': 'June',
      'value': '124',
      'footnotes': [{}]},
     {'year': '1979',
      'period': 'M05',
      'periodName': 'May',
      'value': '123',
      'footnotes': [{}]},
     {'year': '1979',
      'period': 'M04',
      'periodName': 'April',
      'value': '122',
      'footnotes': [{}]},
     {'year': '1979',
      'period': 'M03',
      'periodName': 'March',
      'value': '123',
      'footnotes': [{}]},
     {'year': '1979',
      'period': 'M02',
      'periodName': 'February',
      'value': '122',
      'footnotes': [{}]},
     {'year': '1979',
      'period': 'M01',
      'periodName': 'January',
      'value': '121',
      'footnotes': [{}]},
     {'year': '1978',
      'period': 'M12',
      'periodName': 'December',
      'value': '121',
      'footnotes': [{}]},
     {'year': '1978',
      'period': 'M11',
      'periodName': 'November',
      'value': '120',
      'footnotes': [{}]},
     {'year': '1978',
      'period': 'M10',
      'periodName': 'October',
      'value': '120',
      'footnotes': [{}]},
     {'year': '1978',
      'period': 'M09',
      'periodName': 'September',
      'value': '119',
      'footnotes': [{}]},
     {'year': '1978',
      'period': 'M08',
      'periodName': 'August',
      'value': '119',
      'footnotes': [{}]},
     {'year': '1978',
      'period': 'M07',
      'periodName': 'July',
      'value': '120',
      'footnotes': [{}]},
     {'year': '1978',
      'period': 'M06',
      'periodName': 'June',
      'value': '119',
      'footnotes': [{}]},
     {'year': '1978',
      'period': 'M05',
      'periodName': 'May',
      'value': '118',
      'footnotes': [{}]},
     {'year': '1978',
      'period': 'M04',
      'periodName': 'April',
      'value': '118',
      'footnotes': [{}]},
     {'year': '1978',
      'period': 'M03',
      'periodName': 'March',
      'value': '115',
      'footnotes': [{}]},
     {'year': '1978',
      'period': 'M02',
      'periodName': 'February',
      'value': '116',
      'footnotes': [{}]},
     {'year': '1978',
      'period': 'M01',
      'periodName': 'January',
      'value': '116',
      'footnotes': [{}]},
     {'year': '1977',
      'period': 'M12',
      'periodName': 'December',
      'value': '116',
      'footnotes': [{}]},
     {'year': '1977',
      'period': 'M11',
      'periodName': 'November',
      'value': '117',
      'footnotes': [{}]},
     {'year': '1977',
      'period': 'M10',
      'periodName': 'October',
      'value': '117',
      'footnotes': [{}]},
     {'year': '1977',
      'period': 'M09',
      'periodName': 'September',
      'value': '117',
      'footnotes': [{}]},
     {'year': '1977',
      'period': 'M08',
      'periodName': 'August',
      'value': '117',
      'footnotes': [{}]},
     {'year': '1977',
      'period': 'M07',
      'periodName': 'July',
      'value': '117',
      'footnotes': [{}]},
     {'year': '1977',
      'period': 'M06',
      'periodName': 'June',
      'value': '117',
      'footnotes': [{}]},
     {'year': '1977',
      'period': 'M05',
      'periodName': 'May',
      'value': '116',
      'footnotes': [{}]},
     {'year': '1977',
      'period': 'M04',
      'periodName': 'April',
      'value': '116',
      'footnotes': [{}]},
     {'year': '1977',
      'period': 'M03',
      'periodName': 'March',
      'value': '114',
      'footnotes': [{}]},
     {'year': '1977',
      'period': 'M02',
      'periodName': 'February',
      'value': '113',
      'footnotes': [{}]},
     {'year': '1977',
      'period': 'M01',
      'periodName': 'January',
      'value': '112',
      'footnotes': [{}]},
     {'year': '1976',
      'period': 'M12',
      'periodName': 'December',
      'value': '114',
      'footnotes': [{}]},
     {'year': '1976',
      'period': 'M11',
      'periodName': 'November',
      'value': '113',
      'footnotes': [{}]},
     {'year': '1976',
      'period': 'M10',
      'periodName': 'October',
      'value': '113',
      'footnotes': [{}]},
     {'year': '1976',
      'period': 'M09',
      'periodName': 'September',
      'value': '115',
      'footnotes': [{}]},
     {'year': '1976',
      'period': 'M08',
      'periodName': 'August',
      'value': '114',
      'footnotes': [{}]},
     {'year': '1976',
      'period': 'M07',
      'periodName': 'July',
      'value': '115',
      'footnotes': [{}]},
     {'year': '1976',
      'period': 'M06',
      'periodName': 'June',
      'value': '114',
      'footnotes': [{}]},
     {'year': '1976',
      'period': 'M05',
      'periodName': 'May',
      'value': '115',
      'footnotes': [{}]},
     {'year': '1976',
      'period': 'M04',
      'periodName': 'April',
      'value': '116',
      'footnotes': [{}]},
     {'year': '1976',
      'period': 'M03',
      'periodName': 'March',
      'value': '116',
      'footnotes': [{}]},
     {'year': '1976',
      'period': 'M02',
      'periodName': 'February',
      'value': '116',
      'footnotes': [{}]},
     {'year': '1976',
      'period': 'M01',
      'periodName': 'January',
      'value': '116',
      'footnotes': [{}]}]}]}}

In [30]:
#Wage Index 76-85
data = []
month = []
year = []


for results in json_data['Results']['series'][0]['data']:
    data.append(results["value"])
    month.append(results["periodName"])
    year.append(results["year"])

new_dict = {"year": year, "month": month, "data": data}
wages = pd.DataFrame(new_dict)
wages

     year      month data
0    1985   December  109
1    1985   November  110
2    1985    October  110
3    1985  September  110
4    1985     August  110
..    ...        ...  ...
115  1976        May  115
116  1976      April  116
117  1976      March  116
118  1976   February  116
119  1976    January  116

[120 rows x 3 columns]

In [31]:
headers = {'Content-type': 'application/json'}
data = json.dumps({"seriesid": ['EES10140001'],"startyear":"1986", "endyear":"2018"})
p = requests.post('https://api.bls.gov/publicAPI/v2/timeseries/data/', data=data, headers=headers)
json_data = json.loads(p.text)

In [32]:
data = []
month = []
year = []


for results in json_data['Results']['series'][0]['data']:
    data.append(results["value"])
    month.append(results["periodName"])
    year.append(results["year"])

new_dict = {"year": year, "month": month, "data": data}
wages_2 = pd.DataFrame(new_dict)
wages_2

     year      month data
0    1995   December  105
1    1995   November  105
2    1995    October  105
3    1995  September  105
4    1995     August  105
..    ...        ...  ...
115  1986        May  110
116  1986      April  110
117  1986      March  109
118  1986   February  110
119  1986    January  109

[120 rows x 3 columns]

In [33]:
headers = {'Content-type': 'application/json'}
data = json.dumps({"seriesid": ['EES10140001'],"startyear":"1996", "endyear":"2018"})
p = requests.post('https://api.bls.gov/publicAPI/v2/timeseries/data/', data=data, headers=headers)
json_data = json.loads(p.text)

data = []
month = []
year = []


for results in json_data['Results']['series'][0]['data']:
    data.append(results["value"])
    month.append(results["periodName"])
    year.append(results["year"])

new_dict = {"year": year, "month": month, "data": data}
wages_3 = pd.DataFrame(new_dict)
wages_3

    year     month data
0   2003     April  107
1   2003     March  104
2   2003  February  106
3   2003   January  107
4   2002  December  108
..   ...       ...  ...
83  1996       May  106
84  1996     April  106
85  1996     March  106
86  1996  February  106
87  1996   January  105

[88 rows x 3 columns]

In [34]:
headers = {'Content-type': 'application/json'}
data = json.dumps({"seriesid": ['EES10140001'],"startyear":"2004", "endyear":"2018"})
p = requests.post('https://api.bls.gov/publicAPI/v2/timeseries/data/', data=data, headers=headers)
json_data = json.loads(p.text)

data = []
month = []
year = []


for results in json_data['Results']['series'][0]['data']:
    data.append(results["value"])
    month.append(results["periodName"])
    year.append(results["year"])

new_dict = {"year": year, "month": month, "data": data}
wages_4 = pd.DataFrame(new_dict)
wages_4

Empty DataFrame
Columns: [year, month, data]
Index: []

In [35]:
#Wage Index 1976-2003
wages_f = pd.concat([wages,wages_2,wages_3])
wages_f

    year      month data
0   1985   December  109
1   1985   November  110
2   1985    October  110
3   1985  September  110
4   1985     August  110
..   ...        ...  ...
83  1996        May  106
84  1996      April  106
85  1996      March  106
86  1996   February  106
87  1996    January  105

[328 rows x 3 columns]

In [36]:
#GDP
gdp = pd.read_csv("~/Desktop/GDP.csv")
gdp

           DATE        GDP
0    1947-01-01    243.164
1    1947-04-01    245.968
2    1947-07-01    249.585
3    1947-10-01    259.745
4    1948-01-01    265.742
..          ...        ...
285  2018-04-01  20510.177
286  2018-07-01  20749.752
287  2018-10-01  20897.804
288  2019-01-01  21098.827
289  2019-04-01  21340.267

[290 rows x 2 columns]

In [39]:
#Dow Jones Industrial Average
djia = pd.read_csv("~/Desktop/dja.csv")
djia

         date      real   nominal
0      1/1/15   1437.36     56.54
1      2/1/15   1412.69     55.02
2      3/1/15   1577.63     60.83
3      4/1/15   1843.02     71.78
4      5/1/15   1652.68     65.01
...       ...       ...       ...
1253   6/1/19  26653.16  26599.96
1254   7/1/19  26891.13  26864.27
1255   8/1/19  26429.68  26403.28
1256   9/1/19  26916.83  26916.83
1257  10/1/19  26816.59  26816.59

[1258 rows x 3 columns]